cask_args appdir: '/Applications'

tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"

brew 'cask'
brew "git"
brew "git-flow"
brew "gradle"
brew "mackup"
brew "python3"
brew "wget"
brew "yarn"
brew 'node'
brew "zsh"
brew "zsh-syntax-highlighting"
brew 'gzip'
brew "wget"
brew "mas"

cask "docker"
cask '1password'
cask 'google-chrome'
cask 'slack'
cask "sourcetree"
cask "textmate"

cask 'iterm2'
cask 'android-file-transfer'
cask 'sublime-text'

cask 'alfred'
cask 'caskroom/cask/postman'
cask 'caskroom/cask/cheatsheet'

cask 'caskroom/fonts/font-d2coding'
cask 'caskroom/fonts/font-anonymice-powerline'
cask 'caskroom/fonts/font-consolas-for-powerline'
cask 'caskroom/fonts/font-dejavu-sans-mono-for-powerline'
cask 'caskroom/fonts/font-fira-mono-for-powerline'
cask 'caskroom/fonts/font-inconsolata-dz-for-powerline'
cask 'caskroom/fonts/font-inconsolata-for-powerline'
cask 'caskroom/fonts/font-inconsolata-g-for-powerline'
